dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1S2COEFFFRAC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.M1SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF3_M1SRMPCOEFFFRAC_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S0EN */
#define IFX_PMS_EVRSDCOEFF4_M2S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2EN */
#define IFX_PMS_EVRSDCOEFF4_M2S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3EN */
#define IFX_PMS_EVRSDCOEFF4_M2S3EN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3CLIP */
#define IFX_PMS_EVRSDCOEFF4_M2S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4EN */
#define IFX_PMS_EVRSDCOEFF4_M2S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2RAMPEN */
#define IFX_PMS_EVRSDCOEFF4_M2RAMPEN_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_OFF (0u)

