dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN23 */
#define IFX_PMS_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN23 */
#define IFX_PMS_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN24 */
#define IFX_PMS_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN24 */
#define IFX_PMS_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN24 */
#define IFX_PMS_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN25 */
#define IFX_PMS_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN25 */
#define IFX_PMS_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN25 */
#define IFX_PMS_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN26 */
#define IFX_PMS_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN26 */
#define IFX_PMS_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN26 */
#define IFX_PMS_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN27 */
#define IFX_PMS_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN27 */
#define IFX_PMS_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN27 */
#define IFX_PMS_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN28 */
#define IFX_PMS_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN28 */
#define IFX_PMS_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN28 */
#define IFX_PMS_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN29 */
#define IFX_PMS_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN29 */
#define IFX_PMS_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN29 */
#define IFX_PMS_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN30 */
#define IFX_PMS_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN30 */
#define IFX_PMS_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN30 */
#define IFX_PMS_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN31 */
#define IFX_PMS_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN31 */
#define IFX_PMS_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN31 */
#define IFX_PMS_ACCEN0_EN31_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPMS_BF_H */
